user/tutorials/Nike/C12H26TML_3/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   #codeStream
{

        codeInclude
        #{
            #include "fvCFD.H"
        #};
        codeOptions
        #{
            -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
        #};  
        codeLibs
        #{
            -lmeshTools \
            -lfiniteVolume
        #};
        code
        #{
            const IOdictionary &d = static_cast<const IOdictionary &>(dict);
            const fvMesh &mesh = refCast<const fvMesh>(d.db());
            const scalar PI = 3.1415926535897932384626;

            //double delta = 0.2*5.901;
            double lambda1 = 0.0005;//delta *7.29;
            double delta = 0.0002;//lambda1;///7.29;
            double lambda3 = 0.6*lambda1;

            double Utop = 106.914;
            double Ubottom = -88.322;
            double F2D = 0.01*1000000;//0.05;
            double Gamma3 = 1;
            double dU = mag(Utop - Ubottom);
            
            double A[4] = {1.0, 0.5, 0.35, 0.0};
            double B[4] = {1.0, 0.0, 0.0, 0.025};
            
            double alpha = 2 * PI / lambda1;
            double alphaS = alpha * delta;

            double a1, a2;

            vectorField U(mesh.nCells());
            forAll(U, i)
            {
                //const scalar x = mesh.C()[i][0];
                const scalar z = mesh.C()[i][2];

                U[i][0] = 0.5 * (Utop + Ubottom) + 0.5 * (Utop - Ubottom) * erf(sqrt(PI) * z / delta);
                U[i][1] = 0;
                U[i][2] = 0;

            }

            scalar zS;
            scalar sqrtPI = sqrt(PI);
            for (int i = 0; i < 4; i++)
            {
                forAll(U, j)
                {
                    const scalar x = mesh.C()[j][0];
                    const scalar z = mesh.C()[j][2];
                    zS = z / delta;
                    a1 =  0.25 * exp(sqr(alphaS) * 0.25 / PI) * (erf(zS * sqrt(PI) + alphaS * 0.5 / sqrtPI) - 1);
                    a2 = -0.25 * exp(sqr(alphaS) * 0.25 / PI) * (erf(zS * sqrt(PI) - alphaS * 0.5 / sqrtPI) + 1);
                    U[j][0] += F2D * lambda1 * dU / Gamma3 * A[i] * delta * sin(alpha * x) * (a2 * exp(-z * alpha) - a1 * exp(z * alpha));
                    U[j][2] += F2D * lambda1 * dU / Gamma3 * A[i] * delta * cos(alpha * x) * (a2 * exp(-z * alpha) + a1 * exp(z * alpha));
                }
                alpha *= 0.5;
                alphaS *= 0.5;
            }
            U.writeEntry("", os);
        #};
    
};

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    left
    {
        type            cyclic;
    }
    right
    {
        type            cyclic;
    }
}


// ************************************************************************* //
