user/tutorials/Nike/C12H26TML_3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40960;
        startFace       81472;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          40960;
        startFace       122432;
    }
    left
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          320;
        startFace       163392;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  right;
    }
    right
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          320;
        startFace       163712;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  left;
    }
    bottom
    {
        type            patch;
        nFaces          128;
        startFace       164032;
    }
    top
    {
        type            patch;
        nFaces          128;
        startFace       164160;
    }
)

// ************************************************************************* //
